stm32-hotspot/STM32WB-BLE-Basic-DataThroughput-Server/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_Basic_DataThroughput_Server/STM32_WPAN/App/app_ble.c
  /* Set Connection Interval */
  APP_DBG_MSG("Set Connection Interval \n");  
  uint16_t interval_min = CONN_P(30.0);   // optimal for iphone XR
  uint16_t interval_max = CONN_P(30.0);   
//  uint16_t interval_min = CONN_P(48.75);  // opimtal for Android Samsung Galaxy S10
//  uint16_t interval_max = CONN_P(48.75);    
  uint16_t slave_latency = L2CAP_SLAVE_LATENCY;
  uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
  status = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                     interval_min, interval_max,
                                                     slave_latency, timeout_multiplier);
  if( status == BLE_STATUS_SUCCESS )
  {
    APP_DBG_MSG("ACI_L2CAP_CONNECTION_PARAMETER_UPDATE_REQ, Successfully \n\r");
  }
  else
  {
    APP_DBG_MSG("ACI_L2CAP_CONNECTION_PARAMETER_UPDATE_REQ, Error \n\r");
  }
  
  UTIL_SEQ_WaitEvt(1 << CFG_MY_IDLEEVT_CONN_UPDATE_COMPLETE);  /* Wait for Connection Update complete event to be recieved before proceeding */

  /* Read PHY config */    
  
  status = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,&TX_PHY,&RX_PHY);
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("HCI_LE_READ_PHY, Succesffuly \n");    
    APP_DBG_MSG("Current PHY: TX= %d, RX= %d \n", TX_PHY, RX_PHY);    
  }
  else 
  {
    APP_DBG_MSG("HCI_LE_READ_PHY, Error \n");    
  }
  
}

//[JT] - Toggles between the two PHYs
void PHY_Configuration(void)
{
  tBleStatus status;
  uint8_t TX_PHY, RX_PHY;
  
  /* Set PHY config */    
  APP_DBG_MSG("Set PHY Config \n");
  
  status = hci_le_read_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,&TX_PHY,&RX_PHY);
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("HCI_LE_READ_PHY, Succesffuly \n");    
    APP_DBG_MSG("PHY Param  TX= %d, RX= %d \n", TX_PHY, RX_PHY);    
    if ((TX_PHY == TX_2M) && (RX_PHY == RX_2M))
    {
      APP_DBG_MSG("**TX= %d, **RX= %d \n", TX_1M, RX_1M);
      status = hci_le_set_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,ALL_PHYS_PREFERENCE,TX_1M,RX_1M,0);
    }
    else
    {
      APP_DBG_MSG("**TX= %d, **RX= %d \n", TX_2M_PREFERRED, RX_2M_PREFERRED);
      status = hci_le_set_phy(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,ALL_PHYS_PREFERENCE,TX_2M_PREFERRED,RX_2M_PREFERRED,0);
    } 
    if( status == BLE_STATUS_SUCCESS )
    {
      APP_DBG_MSG("HCI_LE_SET_PHY Update, Successfully \n\r");
    }
    else
    {
      APP_DBG_MSG("HCI_LE_SET_PHY Update, Failed , status: 0x%X\n\r", status);
    }  
  }
  else 
  {
    APP_DBG_MSG("HCI_LE_READ_PHY, Error \n");    
  }  
}
/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 *SPECIFIC FUNCTIONS FOR CUSTOM
 *
 *************************************************************/
static void Adv_Cancel( void )
{
/* USER CODE BEGIN Adv_Cancel_1 */

/* USER CODE END Adv_Cancel_1 */

  if (BleApplicationContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)

  {

    tBleStatus result = 0x00;

    result = aci_gap_set_non_discoverable();

    BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
    if (result == BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  \r\n\r");APP_DBG_MSG("** STOP ADVERTISING **  \r\n\r");
    }
    else
    {
      APP_DBG_MSG("** STOP ADVERTISING **  Failed \r\n\r");
    }

  }

/* USER CODE BEGIN Adv_Cancel_2 */

/* USER CODE END Adv_Cancel_2 */
  return;
}

#if(L2CAP_REQUEST_NEW_CONN_PARAM != 0)
void BLE_SVC_L2CAP_Conn_Update(uint16_t Connection_Handle)
{
/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_1 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_1 */
  if(mutex == 1) {
    mutex = 0;
    index_con_int = (index_con_int + 1)%SIZE_TAB_CONN_INT;
    uint16_t interval_min = CONN_P(tab_conn_interval[index_con_int]);
    uint16_t interval_max = CONN_P(tab_conn_interval[index_con_int]);
    uint16_t slave_latency = L2CAP_SLAVE_LATENCY;
    uint16_t timeout_multiplier = L2CAP_TIMEOUT_MULTIPLIER;
    tBleStatus result;

    result = aci_l2cap_connection_parameter_update_req(BleApplicationContext.BleApplicationContext_legacy.connectionHandle,
                                                       interval_min, interval_max,
                                                       slave_latency, timeout_multiplier);
    if( result == BLE_STATUS_SUCCESS )
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully \r\n\r");
    }
    else
    {
      APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed \r\n\r");
    }
  }
/* USER CODE BEGIN BLE_SVC_L2CAP_Conn_Update_2 */

/* USER CODE END BLE_SVC_L2CAP_Conn_Update_2 */
  return;
}
#endif

#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0 )
static void Connection_Interval_Update_Req( void )
{
  if (BleApplicationContext.Device_Connection_Status != APP_BLE_FAST_ADV && BleApplicationContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
  }
  return;
}
#endif

/* USER CODE BEGIN FD_SPECIFIC_FUNCTIONS */
//[JT]  
void APP_BLE_Key_Button1_Action(void)
{
  P2PS_APP_SW1_Button_Action();  
}

void APP_BLE_Key_Button2_Action(void)
{
  UTIL_SEQ_SetTask( 1<<CFG_TASK_SW2_BUTTON_PUSHED_ID, CFG_SCH_PRIO_0);  
}

void APP_BLE_Key_Button3_Action(void)
{
  
}

/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* pdata)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);
  return;
}

void hci_cmd_resp_release(uint32_t flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

void hci_cmd_resp_wait(uint32_t timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);
  return;
}

static void BLE_UserEvtRx( void * pPayload )
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *pParam;

  pParam = (tHCI_UserEvtRxParam *)pPayload;

  svctl_return_status = SVCCTL_UserEvtRx((void *)&(pParam->pckt->evtserial));
  if (svctl_return_status != SVCCTL_UserEvtFlowDisable)
  {
    pParam->status = HCI_TL_UserEventFlow_Enable;
  }
  else
  {
    pParam->status = HCI_TL_UserEventFlow_Disable;
  }

  return;
}

static void BLE_StatusNot( HCI_TL_CmdStatus_t status )
{
  uint32_t task_id_list;
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);

      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);

      break;

    default:
      break;
  }
  return;
}

void SVCCTL_ResumeUserEventFlow( void )
{
  hci_resume_flow();
  return;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
